dependencies/OpenFOAM/tutorials/incompressible/pimpleFoam/LES/wallMountedHump/setups.orig/common/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 351;

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        offset          0;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    topWall
    {
        type            slip;
    }

    "zPeriodic_.*"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
