dependencies/OpenFOAM/tutorials/incompressible/pimpleFoam/LES/wallMountedHump/setups.orig/common/system/columnAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

columnAverage
{
    // Mandatory entries
    type            columnAverage;
    libs            (fieldFunctionObjects);

    // Note: include processorCyclics!
    patches         ( zPeriodic_half0 "proc.*throughzPeriodic_half0" );
    fields
    (
        UMean
        UPrime2Mean
    );

    // Inherited entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       $tStartAvg;
    executeControl  writeTime;
    writeControl    none;
}


// ************************************************************************* //
