dependencies/OpenFOAM/tutorials/incompressible/pimpleFoam/LES/wallMountedHump/setups.orig/common/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldAverage
{
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeControl    writeTime;

    timeStart       $tStartAvg;

    fields
    (
        U
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        p
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
        nut
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
        nuTilda
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
        k
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
        omega
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
        wallShearStress
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
    );
}


// ************************************************************************* //
